import os
import json
import openai

openai.api_key = "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"
global defaultEngine
defaultEngine = "text-davinci-003"


def lol(message):
    prompt = "Ти кваліфікований психолог.  Будь ласка, оцініни рівень небезпеки проблеми, описаної нижче, за шкалою від 1 до 10, де 1 - найнижчий рівень небезпеки, а 10 - найвищий рівень небезпеки. Зазначена проблема є важливою для нас, тому дуже важливо отримати від тебе правильну оцінку її рівня небезпеки. Будь ласка, уважно проаналізуйте описану ситуацію та вкажіть число від 1 до 10, де 1 означає низький рівень небезпеки, а 10 - високий рівень небезпеки.Звертаємо вашу увагу, що пацієнти можуть писати повну маячню або писати слова в агресивній формі ('я хочу його перетворити на кашу' і тд). ми хочемо щоб ти допоміг нам забезпечити надійну та вчасну допомогу пацієнтам. Головне що потрібно пам'ятати це те небезпека для оточуючтих (смертельна, чи нашкодити їм, насильство і тд) та собі (селфхапмінг, самогубства і тд) це 10. Гейство, розумово відсталість не є небезпечною, подібне також! Ось опис проблеми чи сама проблема, але все обдумай: " + message + ". Мені потрібно щоб ти відповів ТІЛЬКИ одним цілим числом за шкалою від 1 до 10, без тексту і розділових знаків."
    data = openai.Completion.create(engine=defaultEngine, prompt=prompt, max_tokens=200)
    msg = data["choices"][0]["text"]
    return msg