import images from './images';
export   const languages = [
    "Англійська",
    "Арабська",
    "Бенгальська",
    "Бірманська",
    "Гінді",
    "Грецька",
    "Гуджараті",
    "Іспанська",
    "Італійська",
    "Каннада",
    "Китайська",
    "Корейська",
    "Кхмерська",
    "Маратхі",
    "Нідерландська",
    "Німецька",
    "Панджабі",
    "Південно-міньська",
    "Польська",
    "Португальська",
    "Румунська",
    "Сингальська",
    "Суахілі",
    "Тамільська",
    "Турецька",
    "Українська",
    "Урду",
    "Узбецька",
    "Французька",
    "Яванська",
    "Японська"
];
export const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
export   const digits = /^[0-9]*$/;
export {images};
